lkolbly/cmsis-svd/data/Cypress/MB9B160L.svd
        <!-- REGISTER "WTYR" -->
        <register>
          <name>WTYR</name>
          <description>Year Register</description>
          <addressOffset>0x134</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TY" -->
            <field>
              <name>TY</name>
              <description>2nd digit of the year information</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Y" -->
            <field>
              <name>Y</name>
              <description>1st digit of the year information</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALMIR" -->
        <register>
          <name>ALMIR</name>
          <description>Alarm Minute Register</description>
          <addressOffset>0x138</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAMI" -->
            <field>
              <name>TAMI</name>
              <description>2nd digit of the alarm-set minute information</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AMI" -->
            <field>
              <name>AMI</name>
              <description>1st digit of the alarm-set minute information</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALHR" -->
        <register>
          <name>ALHR</name>
          <description>Alarm Hour Register</description>
          <addressOffset>0x13C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAH" -->
            <field>
              <name>TAH</name>
              <description>2nd digit of the alarm-set hour information</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AH" -->
            <field>
              <name>AH</name>
              <description>1st digit of the alarm-set hour information</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALDR" -->
        <register>
          <name>ALDR</name>
          <description>Alarm Date Register</description>
          <addressOffset>0x140</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAD" -->
            <field>
              <name>TAD</name>
              <description>2nd digit of the alarm-set date information</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AD" -->
            <field>
              <name>AD</name>
              <description>1st digit of the alarm-set date information</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALMOR" -->
        <register>
          <name>ALMOR</name>
          <description>Alarm Month Register</description>
          <addressOffset>0x144</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAMO0" -->
            <field>
              <name>TAMO0</name>
              <description>2nd digit of the alarm-set month information</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AMO" -->
            <field>
              <name>AMO</name>
              <description>1st digit of the alarm-set month information</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALYR" -->
        <register>
          <name>ALYR</name>
          <description>Alarm Years Register</description>
          <addressOffset>0x148</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAY" -->
            <field>
              <name>TAY</name>
              <description>2nd digit of the alarm-set year information</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AY" -->
            <field>
              <name>AY</name>
              <description>1st digit of the alarm-set year information</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTTR0" -->
        <register>
          <name>WTTR0</name>
          <description>Timer Setting Register 0</description>
          <addressOffset>0x14C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM7_0" -->
            <field>
              <name>TM7_0</name>
              <description>Timer Setting Register</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTTR1" -->
        <register>
          <name>WTTR1</name>
          <description>Timer Setting Register 1</description>
          <addressOffset>0x150</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM15_8" -->
            <field>
              <name>TM15_8</name>
              <description>Timer Setting Register</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTTR2" -->
        <register>
          <name>WTTR2</name>
          <description>Timer Setting Register 2</description>
          <addressOffset>0x154</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM17_16" -->
            <field>
              <name>TM17_16</name>
              <description>Timer Setting Register</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCAL0" -->
        <register>
          <name>WTCAL0</name>
          <description>Frequency Correction Value Setting Register 0</description>
          <addressOffset>0x158</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCAL0" -->
            <field>
              <name>WTCAL0</name>
              <description>Frequency correction value setting bits 0</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
